---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.ClearFields
source: html/5efbbd43-ed58-e46e-5bda-7d506c3a757e.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.ClearFields Method

Removes all fields.

## Syntax (C#)
```csharp
public void ClearFields()
```